INSERT INTO Singer(name)
VALUES 
	('Макsим'),
	('Григорий Лепс'),
	('Niletto'),
	('Полина Гагарина'),
	('Земфира'),
	('Тимати'),
	('Стас Михайлов'),
	('Михаил Круг'),
	('Кукрыниксы'),
	('Ленинград'),
	('Баста'),
	('Snoop Doggg');

INSERT INTO Genre(genre)
VALUES 
	('поп-музыка'),
	('поп-рок'),
	('русский рок'),
	('рэп'),
	('шансон'),
	('Hip-Hop');
	
INSERT INTO Album(title, yaer_of_release)
VALUES
	('Трудный возраст', 2006),
	('Полигамность', 2018),
	('Попроси у облаков', 2007),
	('ХНА', 2011),
	('Поп и балда', 2014),
	('Северный Ветер', 2021),
	('GrooveOn', 2013),
	('Ляля...', 2018),
	('Простым', 2018),
	('Честь Имею! Кони Привередливые', 2020),
	('Последняя Песня', 2018);
	
INSERT INTO Track(id_album, title_track, duration)
VALUES
	(23, 'Нежность', 196),
	(23, 'Сантиметры дыханья', 207),
	(23, 'Мой рай', 201),
	(24, 'Абонент Недоступен', 192),
	(25, 'Колыбельная', 211),
	(25, 'Я тебя не прощу никогда', 255),
	(25, 'Прикосновенья', 3.25),
	(26, 'Твистосвист', 135),
	(26, 'Осень диско', 195),
	(27, 'Русалка', 185),
	(28, 'Белуга', 142),
	(28, 'Северная Прелюдия', 87),
	(28, 'Бенедикт', 298),
	(28, 'Прах', 162),
	(29, 'GrooveOn - Virtual Vault Remix', 384),
	(30, 'Сердце Танцует', 184),
	(30, 'Кидс', 199),
	(31, 'Повезет', 223),
	(31, 'Сирень', 173),
	(32, 'Девушка из Нагасаки', 208),
	(32, 'Наводчица', 115),
	(33, 'Песня наивного человека', 254),
	(33, 'Пол жизни', 247),
	(33, 'Хрустальный мир', 254),
	(33, 'Мой новый мир', 214);
	
INSERT INTO Collection(title, yaer_of_release)
VALUES
	('Русский шансон', 2017),
	('Музыка для настроения', 2020),
	('Танцевальный сборник', 2018),
	('Русский рок', 2021),
	('Лето 2020', 2020),
	('Лучшие песни', 2016),
	('Русский рэп', 2019),
	('Руский поп', 2019);
	
INSERT INTO SingerGenre
VALUES
	(25, 13),
	(26, 17),
	(26, 14),
	(27, 13),
	(28, 13),
	(29, 15),
	(30, 18),
	(31, 17),
	(32, 17),
	(33, 15),
	(34, 14),
	(35, 16),
	(36, 18);
	
INSERT INTO SingerAlbum
VALUES
	(25, 23),
	(25, 24),
	(27, 25),
	(34, 26),
	(34, 27),
	(29, 28),
	(30, 29),
	(36, 29),
	(27, 30),
	(27, 31),
	(26, 32),
	(33, 33);
	
INSERT INTO CollectionTrack
VALUES
	(1, 70),
	(1, 71),
	(2, 65),
	(2, 51),
	(2, 53),
	(3, 65),
	(3, 66),
	(3, 67),
	(4, 61),
	(4, 58),
	(4, 59),
	(5, 51),
	(5, 56),
	(6, 52),
	(6, 55),
	(7, 65),
	(7, 67),
	(8, 57),
	(8, 54),
	(8, 66),
	(8, 52);
	

	
	
	
	
	